const words = require('../../word');
const { Markup } = require('telegraf');

module.exports = (bot) => {
  bot.hears(words.wordsAbiturient, (ctx) => {
    const buttonsAbit = Markup.keyboard([
      ['🧠 Спеціальності'],
      ['😪🅱️✔ Необхідні ЗНО'],
      ['🎓 Програма «Подвійного диплома»'],
      ['😁🏅 Активності'],
    ])
      .oneTime()
      .resize();

    ctx.reply(
      'Окей 🙂 Ми - кафедра Інженерного навчально-наукового інституту ЗНУ, і ми дуже активні. 😉 Не тільки нудно навчаємось, слухаємо лекції, пишемо та захищаємо лабораторні і курсові, а ще й відвідуємо та організовуємо різні цікаві заходи. А ще ми вчимося за програмою «Подвійного диплома» з европейськими університетами.',
      buttonsAbit
    );
  });

  bot.hears(words.wordsProgramsKafedra, (ctx) => {
    const buttonsSpecialty = Markup.keyboard([
      ['Інформаціна економіка'],
      ['Фінанси, банківська справа та страхування'],
      ['Підприємництво, торгівля та біржова діяльність'],
      ['⬅️ Головне меню'],
    ]);

    ctx.reply(
      `Кого ж ми навчаємо? 

На нашій кафедрі ми проводимо навчання за трьома спеціальностями:
✅051 - Інформаційна економіка
✅072 - Фінанси, банківська справа та страхування
✅076 - Підприємництво, торгівля та біржова діяльність
  
Усі ці спеціальності відповідають сучасним вимогам работодавців, але вони не накладають на студента ярмо #тижекономіст або #тижфінансіст. Під час навчання кожен студент пробує себе у різних сферах і врешті-решт знаходить те, що цікавить його найбільше: програмування, аналітика, маркетинг, фінанси, біржова діялність тощо. А далі справа за малим - постійне самовдосконалення в обраній сфері!`,

      buttonsSpecialty
    );
  });
  bot.hears(words.wordInformEconom, async (ctx) => {
    bot.telegram.sendChatAction(ctx.chat.id, 'upload_photo');
    await ctx.reply(
      `✅ Спеціальність 051 Економіка 
✅Напрямок підготовки: Інформаціна економіка`
    );
    await ctx.reply(
      `Освітня програма передбачає професійну підготовку з використання сучасних інформаційних систем і технологій: 
✔️ Збору, інтелектуального аналізу та обробки статистичних даних
✔️ Виявлення та вирішення бізнес-проблем за допомогою економіко-математичних методів
✔️ Прогнозування соціально-економічних процесів
✔️ Технологій прийняття рішень
✔️ Навички програмування, 
✔️ Проектування та адміністрування баз даних
✔️ Створення комп’ютерних мереж, безпеки інформації
✔️ Управління проектами інформатизації, тощо.

✅ Додаткова інформація про спеціальність на сайті кафедри:  https://znuiepf.com.ua/?page_id=61
✅ Необхідну інформацію про освітню програму можна знайти й за посиланнями:
https://www.znu.edu.ua/opp2019-ii/4138.ukr.html (для бакалаврів)
https://www.znu.edu.ua/opp2019-ii/4173.ukr.html (для магістрів)`
    );
    const buttonsIe = {
      parse_mode: 'HTML',
      ...Markup.inlineKeyboard([
        Markup.button.callback('ЗНО', 'ЗНО'),
        Markup.button.callback('Як навчатись?', 'Як навчатись'),
      ]),
    };

    await ctx.replyWithPhoto(
      { source: 'img/ie.jpg' },
      // {
      //   caption: 'Чат-бот кафедри ІЕПФ ІННІ ЗНУ',
      // },

      buttonsIe
    );
  });

  bot.hears(words.wordFinance, async (ctx) => {
    await ctx.reply(`✅ Спеціальність 072 - Фінанси, банківська справа та страхування`);
    await ctx.reply(
      `Єдина економічна спеціальність, що цілеспрямовано готує фахівців для роботи у фінансових установах (банківські установи, страхові компанії, органи місцевого самоврядування, органи казначейської служби, органи податкової служби) та фінансових службах підприємств та організацій різних форм власності
✅ Додаткова інформація про спеціальність на сайті кафедри:  https://znuiepf.com.ua/?page_id=63   
  `
    );
    const buttonsIe = {
      parse_mode: 'HTML',
      ...Markup.inlineKeyboard([
        Markup.button.callback('ЗНО', 'ЗНО'),
        Markup.button.callback('Як навчатись?', 'Як навчатись'),
      ]),
    };

    await ctx.replyWithPhoto(
      { source: 'img/fin.jpg' },
      // {
      //   caption: 'Чат-бот кафедри ІЕПФ ІННІ ЗНУ',
      // },

      buttonsIe
    );
  });

  bot.hears(words.wordEP, async (ctx) => {
    await ctx.reply(`✅ Спеціальність 076 - Підприємництво, торгівля та біржова діяльність`);
    await ctx.reply(
      `"Підприємництво, торгівля та біржова діяльність" – одна із тих спеціальностей, що користується зростаючим попитом на ринку праці, дозволяє реалізувати себе у бізнесі та досягти матеріального добробуту. Наші випускники – конкурентоспроможні спеціалісти у багатьох сферах, адже дана спеціальність має широкий спектр застосування: від матеріального виробництва – до сфери послуг, від приватного бізнесу – до транснаціональних корпорацій. Спільним для цього спектру є одне – сучасні вимоги ринку, які диктують потребу в застосуванні знань, умінь та навичок зі спеціальності "Підприємництво, торгівля та біржова діяльність".

✅ Додаткова інформація про спеціальність на сайті кафедри:  https://znuiepf.com.ua/?page_id=65`
    );
    const buttonsIe = {
      parse_mode: 'HTML',
      ...Markup.inlineKeyboard([
        Markup.button.callback('ЗНО', 'ЗНО'),
        Markup.button.callback('Як навчатись?', 'Як навчатись'),
      ]),
    };

    await ctx.replyWithPhoto(
      { source: 'img/ep.jpg' },
      // {
      //   caption: 'Чат-бот кафедри ІЕПФ ІННІ ЗНУ',
      // },

      buttonsIe
    );
  });

  bot.hears(words.wordActivity, async (ctx) => {
    ctx.reply(`✅ Спеціальність 076 - Підприємництво, торгівля та біржова діяльність`);
    ctx.reply(
      `Запевняємо, що й відпочивати та влаштовувати різні активності ми також добре вміємо!) Наша команда супергероїв-помічників завжди з радістю готує чи бере участь у різних заходах:
✅Наукові пікніки
✅Arduino Day
✅Різноманітні хакатони
✅Конференції
✅Організовуємо активний відпочинок: екскурсії та спортивні ігри
✅Проводимо ділові ігри разом із школярами
✅На лабораторних роботах займаємось цікавими кейсами
✅Проводимо лекції з запрошеними гостями (податкова, центр управління інформаційними технологіями, банківськи установи тощо)
✅відвідуємо з екскурсіями Запорізькі ІТ-компанії
✅Посвячуємо своїх першокурсників у студенти
✅та багато-багато іншого

Хочеш переглянути фото?
  `
    );
    const buttonsActive = {
      parse_mode: 'HTML',
      ...Markup.inlineKeyboard([
        Markup.button.callback('Так', 'Так'),
        Markup.button.callback('Назад', 'Меню'),
      ]),
    };

    await ctx.replyWithPhoto(
      { source: 'img/active.jpg' },

      buttonsActive
    );
  });
  bot.hears(words.wordDwaD, async (ctx) => {
    const buttonsDwaD = {
      parse_mode: 'HTML',
      ...Markup.inlineKeyboard([Markup.button.callback('Назад', 'Меню')]),
    };
    await ctx.reply(
      `ЄВРОПРОЄКТ КАФЕДРИ   СПІЛЬНО З ПАРТНЕРСЬКИМИ УНІВЕРСИТЕТАМИ ПОЛЬЩІ "2D-Подвійний диплом"`
    );
    await ctx.reply(
      `Європейська освіта за українські гроші
ВСТУПАЙ НА СПЕЦІАЛЬНОСТІ КАФЕДРИ, ВИВЧАЙ ВПРОДОВЖ РОКУ ПОЛЬСЬКУ МОВУ В ЗНУ, А НА ДРУГИЙ РІК ВСТУПАЙ ДО УНІВЕРСИТЕТУ-ПАРТНЕРА В ПОЛЬЩІ
✅ 75% ЧАСУ НАВЧАННЯ – В УКРАЇНІ.

✅ Додаткова інформація про програму "2D-Подвійний диплом":  https://znuiepf.com.ua/?page_id=170`
    );
    const buttonsIe = {
      parse_mode: 'HTML',
      ...Markup.inlineKeyboard([
        Markup.button.callback('ЗНО', 'ЗНО'),
        Markup.button.callback('Як навчатись?', 'Як навчатись'),
      ]),
    };

    await ctx.replyWithPhoto(
      { source: 'img/dwad.jpg' },

      buttonsDwaD
    );
  });

  bot.hears(words.wordsZNO, getZNO);

  bot.action(['Почати', 'Меню'], getStart);
  bot.action(['ЗНО'], getZNO);
  bot.action(['Як навчатись'], getLearn);
  bot.action(['Так'], getFoto);

  async function getStart(ctx) {
    bot.telegram.sendChatAction(ctx.chat.id, 'upload_photo');
    const buttonsNext = Markup.keyboard([
      ['👩‍💻 Абітурієнт'],
      ['📈 Студент'],
      ['👨‍🏫 Викладачі'],
      ['📑 Залишити анкету'],
    ])
      .oneTime()
      .resize();
    await ctx.reply(`Дякуємо, що ти тепер з нами - завдяки тобі наша сім'я росте!) 😊
    Не найкраще моє фото, але ось так я виглядаю 🙂`);
    await ctx.replyWithPhoto(
      { source: 'img/robot.jpg' },
      {
        caption: 'Чат-бот кафедри ІЕПФ ІННІ ЗНУ',
      }
    );
    await ctx.reply(
      `Якщо ти абітурієнт і у тебе є запитання щодо вступу чи навчання на нашій кафедрі, то тисни "Абітурієнт".
    
    Якщо ти студент і хочеш дізнатися інформацію щодо навчального процесу, то тисни "Студент".
    
    Якщо ти викладач і хочеш бути в курсі подій, то тисни  "Викладач".  
    
    А якщо у тебе є інші запитання чи пропозиції, то тисни на "Написати модератору" тут чи у головному меню і пиши запитання - ми прочитаємо та відповімо як тільки матимемо змогу.
      
    Щоб відписатись від бота, у будь-який момент пиши слово "stop".`,
      buttonsNext
    );
  }

  async function getFoto(ctx) {
    const buttonsActive = {
      parse_mode: 'HTML',
      ...Markup.inlineKeyboard([Markup.button.callback('Назад', 'Меню')]),
    };
    await ctx.replyWithPhoto({ source: 'img/fotoactive/keis.jpg' });
    await ctx.replyWithPhoto({ source: 'img/fotoactive/miss.jpg' });
    await ctx.replyWithPhoto({ source: 'img/fotoactive/prof.jpg' });
    await ctx.replyWithPhoto({ source: 'img/fotoactive/prik1.jpg' });
    await ctx.replyWithPhoto({ source: 'img/fotoactive/prik2.jpg' });
    await ctx.replyWithPhoto({ source: 'img/fotoactive/prik3.jpg' }, buttonsActive);
  }

  function getZNO(ctx) {
    let buttonsZNO = {};
    console.log(ctx.match[0]);
    if (ctx.match[0] === '😪🅱️✔ Необхідні ЗНО') {
      console.log('Yes');
      buttonsZNO = Markup.keyboard([
        ['Інформаціна економіка'],
        ['Фінанси, банківська справа та страхування'],
        ['Підприємництво, торгівля та біржова діяльність'],
        ['⬅️ Головне меню'],
      ]);
    }
    ctx.reply(
      `Для вступу на нашу кафедру (спеціальності 051, 072 та 076) використовується такий перелік ЗНО:
✅ Українська мова та література - коефіцієнт = 0.3,
✅ Українська мова та література - коефіцієнт = 0.3,
✅ Історія України або Іноземна мова, або Біологія, або Географія, або Фізика, або Хімія - коефіцієнт = 0.3`,
      buttonsZNO
    );
  }

  function getLearn(ctx) {
    buttonsLearn = Markup.keyboard([
      ['Інформаціна економіка'],
      ['Фінанси, банківська справа та страхування'],
      ['Підприємництво, торгівля та біржова діяльність'],
      ['⬅️ Головне меню'],
    ]);

    ctx.reply(
      `Як можна навчатися?

✅ Вступ після повної загальної середньої освіти (школа/ліцей/гімназія) на денну чи заочну форму навчання на спеціальності 051, 072 чи 076.
✅ Вступ після закінченого "молодшого спеціаліста" (коледж) на денну чи заочну скорочену форму навчання на спеціальності 051, 072 чи 076.
✅ Вступ після закінченого бакалаврату на магістратуру денної чи заочної форми за спеціальностями 051, 072 чи 076.
`,
      buttonsLearn
    );
  }
};
