const teachers = [
  {
    id: 'MN',
    name: 'Метеленко Наталя Георгіївна',
    foto: 'img/teacher/metelenko.jpg',
    phd: 'доктор економічних наук, професор',
    subject: [
      'Фінансовий менеджмент',
      'Фінансовий контролінг',
      'Фінансовий аналіз',
      'Управління фінансовою санацією та банкротством',
      'Управління ризиками господарської діяльності',
      'Управління фінансовою безпекою держави та підприємницьких структур',
      'Європейські інтеграційні процеси в економіці, фінансах та менеджменті',
    ],
    konsult: `Понеділок 12:00-13:00 Середа 12:00-13:00 П’ятниця 12:00-13:00`,
    biograf: `Закінчила у 1988 р. Запорізький індустріальний інститут за спеціальністю металургія кольорових металів, отримала повну вищу освіту та диплом з відзнакою. З 1988 р. працювала на ВАТ «Запорізький завод високовольтної апаратури». У 1997 році отримала другу вищу освіту в Запорізькому інституті економіки та інформаційних технологій за спеціальністю «Фінанси і кредит».

    Науково-педагогічна діяльність охоплює період з вересня 1998 р. до теперішнього часу. У 2002 році присуджено науковий ступінь к.е.н. зі спеціальності 08.00.06 – економіка підприємства та організація виробництва, у 2003 р. присвоєно вчене звання доцента кафедри «Фінансів та бухгалтерського обліку» ЗІЕІТ. У 2011 році присуджено науковий ступінь д.е.н. зі спеціальності 08.00.04 – економіка та управління підприємствами (за видами економічної діяльності), у 2015 році присвоєно вчене звання професора кафедри фінансів ЗДІА. Є дійсним членом «Академії економічних наук» України.
    
    Досвід практичної діяльності охоплює період з 1998 р. до 2017 р. в реальному секторі економіки в енергетичній галузі в сферах: інженерії, економіки та фінансів, бухгалтерського обліку та оподаткування, управління підприємством, співпраці з банківськими установами, аудиторами, арбітражним керуючим, контролюючими органами.
    
    З 2014 р. по 2020 р. – завідувач кафедри фінансів, банківської справи та страхування ЗДІА, сьогодні Інженерний навчально-науковий інститут ЗНУ.
    
    З 2020 р. по теперішній час – завідувач кафедри інформаційної економіки, підприємництва та фінансів Інженерного навчально-наукового інституту ЗНУ. На посаді завідувача кафедри (з 2002 р. до теперішнього часу) керувала процесами: ліцензування та акредитації; реформування спеціальності та її розвитком; розробки нових освітніх програм.`,
    science: `Наукова діяльність та напрями дослідження: в сфері економіки промислових підприємств – розвинуто теорію і практику внутрішнього господарського механізму промислових підприємств та управління підприємствами; в сфері державних фінансів – науково – дослідні роботи за замовленням Міністерства фінансів України за такими напрямами дослідження: врегулювання міжбюджетних відносин, удосконалення фінансово – бюджетної політики, удосконалення Податкового та Бюджетного Кодексів, реформування державних фінансів; в сфері фінансів підприємницьких структур – розвинуто теорію і практику управління фінансово – економічною безпекою; в сфері промислового менеджменту – розвинуто теорію, методологію та прикладний інструментарій управління промисловими підприємствами, їх економічною безпекою; у сфері державного управління – розвинуто теоретичні та методичні підходи до формування екологічної політики регіону в умовах децентралізації влади.

    Педагогічна діяльність включає проведення лекційних та практичних занять з дисциплін «Фінансовий менеджмент», «Фінансовий контролінг», «Фінансовий аналіз», «Управління фінансовою санацією та банкрутством», «Управління ризиками господарської діяльності», «Управління фінансовою безпекою держави та підприємницьких структур», «Європейські інтеграційні процеси в економіці, фінансах та менеджменті»; тренінгові заходи з державними службовцями ДПС; керівництво магістерськими роботами; керівництво аспірантами.
    
    Результатами науково-педагогічної діяльності є одноосібні та колективні монографії, навчальні посібники, наукові публікації у вітчизняних та зарубіжних фахових виданнях, патенти, навчально-методичні посібники та інші наукові праці.`,
  },

  {
    id: 'GL',
    name: 'Глущевський В`ячеслав Валентинович',
    foto: 'img/teacher/gluschevs.jpg',
    phd: 'доктор економічних наук, професор',
    subject: [
      'Економіко-математичне моделювання (ОПР «бакалавр»)',
      'Статистика (ОПР «бакалавр»)',
      ' Архітектурна методологія моделювання підприємств в інформаційній економіці',
      'Методологія наукових досліджень в інформаційній економіці (ОПР «магістр»)',
    ],
    konsult: 'Середа 13:00 - 15:00',
    biograf: `Народився 25 січня 1973 року.

 У 1995 році закінчив математичний факультет Запорізького національного університету за спеціальністю «Прикладна математика», а у 1999 році - Запорізьку державну інженерну академію, факультет післядипломної освіти за спеціальністю «Економіка підприємства».
 
 У вересні 2002 року захистив кандидатську дисертацію за спеціальністю 08.03.02 - Економіко-математичне моделювання, а в листопаді 2018 року - дисертацію на здобуття наукового ступеня доктора економічних наук за спеціальністю 08.00.11 - Математичні методи, моделі та інформаційні технології в економіці. Захисти відбулися у спеціалізованій вченій раді Д 26.006.07ДВНЗ«Київський національний економічний університет імені Вадима Гетьмана». У 2004 році отримав вчене звання доцента кафедри економічної кібернетики Запорізької державної інженерної академії.
 
 З 1996 року працював у Запорізькій державній інженерній академії: 1996-2002 рр. - аспірант, асистент, старший викладач, доцент кафедри математичних методів економіки та інформаційних технологій, 2003-2016 рр. - декан факультету економіки та управління, 2016-2017рр. - професор, а з лютого 2018 р. і по теперішній час - завідувач кафедри економіки та інформаційних технологій Інженерного інституту Запорізького національного університету.
 
 Науково-педагогічний стаж - 28 років.`,
    science: `Сфери наукових інтересів: концептуальне моделювання соціально-економічних систем і процесів, економіко-математичне моделювання адаптивних систем управління в економіці, статистичне моделювання та прогнозування, розроблення методів і моделей автоматизованої підтримки рішень на базі інформаційних систем і технологій. Здійснює розвиток принципів багатомодельності та стратифікації при розробці теоретико-методологічних підходів і математичного інструментарію відображення, аналізу, синтезу й координації асинхронних моделей динамічно взаємодіючих підсистем мікроекономічних систем.

 Є розробником нового наукового напряму — стратифікаційного метамоделювання для конструювання комплексних моделей діяльності мікроекономічних систем різних видів економічної діяльності (промислові підприємства, банківські установи, державні органи влади тощо). Під його науковим керівництвом були підготовлені та захищені дві дисертаційні роботи (2009 р. та 2014 р.) на здобуття наукового ступеня кандидата економічних наук за спеціальністю 08.00.11 – «Математичні методи, моделі та інформаційні технології в економіці». Неодноразово брав участь в атестації наукових працівників як офіційний опонент.
 
 Веде активну роботу по залученню студентів до наукової роботи. Здійснює керівництво кваліфікаційними роботами магістрів за освітньо-професійною програмою Економічна кібернетика таким текстом та Інформаційна економіка.
 
 Автор і співавтор понад 100 наукових праць та навчально-методичних посібників, серед яких 7 монографій (1 - одноосібна, 6 - колективні).
 
 За плідну роботу з обдарованою молоддю, багаторічну сумлінну працю, вагомий особистий внесок у підготовку висококваліфікованих фахівців та плідну науково-педагогічну діяльність неодноразово отримував грамоти та подяки ректора Запорізької державної інженерної академії (з 2019 року Інженерний інститут Запорізького національного університету).`,
  },

  {
    id: 'DO',
    name: 'Дробишева Олена Олегівна',
    foto: 'img/teacher/drobisheva.jpg',
    phd: 'доцент, кандидат економічних наук',
    subject: [
      'Економіка підприємства',
      'Економічний аналіз',
      'Інноваційний розвиток підприємства',
      'Конкурентоспроможність підприємства',
      'Глобальна економіка',
    ],
    konsult: 'понеділок 13:00-14:00',
    biograf: `У 1997 р. закінчила Запорізький державний університет за спеціальністю «Облік і аудит».

    Кандидат економічних наук зі спеціальності 08.00.04 «Економіка та управління підприємствами» за видами економічної діяльності (2015 р.).
    
    З 2018 р. консультант Проекту Проміс (Проект МТД «Партнерство для розвитку міст»,що впроваджує Федерація канадських муніципалітетів (ФКМ) за фінансової підтримки Міністерства міжнародних справ Канади).
    
    Стаж педагогічної роботи у вищих навчальних закладах освіти ІV рівня акредитації – 20 років.
    
    Професійна діяльність:
    
    1997-2001 – асистент кафедри економіки ринкових відносин Запорізького державного університету.
    
    2002-2007 – викладач кафедри фінансів та кредиту Запорізького Національного університету.
    
    2008-2015 – старший викладач кафедри економіки підприємства Запорізької державної інженерної академії.
    
    2015 – дотепер доцент кафедри економіки підприємства Інженерного інституту ЗНУ.`,
    science: `Тема кандидатської дисертації

    «Антикризове управління як інструмент запобігання банкрутства промислових підприємств в сучасних умовах».
    
    Коло наукових інтересів: антикризове управління вітчизняними підприємствами; управління інноваційним розвитком та конкурентоспроможністю підприємств, проблеми економічного аналізу.
    
    Має більше 100 наукових публікацій, з них за останні п’ять років – 2 монографії, 8 праць навчально-методичного характеру, більше 30 публікацій у фахових виданнях. Під науковим керівництвом студентами опубліковано більш ніж 50 наукових праць та підготовлено тези доповідей на науково-практичні конференції.
    
    Організація участі студентів в конкурсі бізнес-планів підприємницької діяльності в рамках діяльності Центру розвитку підприємництва Інженерного інституту «Бізнес-Інкубатор».`,
  },

  {
    id: 'GK',
    name: 'Жовнір-Василенко Ксенія Володимирівна',
    foto: 'img/teacher/zhovnrvasilenko.jpg',
    phd: 'Викладач',
    subject: ['Українська (російська) мова'],
    konsult: `Середа 10:00 – 11:00, П'ятниця 12:00 – 13:00`,
    biograf: `У 2003 році закінчила Запорізький державний університет і отримала повну вищу освіту за спеціальністю «Українська мова та література». Здобула кваліфікацію філолога, викладача української мови та літератури. З 2003 до 2019 року працювала в Запорізькій державній академії на кафедрі іноземних мов, викладала іноземним студентам українську (російську) мову.

    З 2003 року працює в Запорізькій державній інженерній академії з іноземними студентами. За сумісництвом займає посаду провідного фахівця в Центрі освітніх послуг для іноземних громадян. Працює над залученням студентів до науково-дослідної роботи. Веде профорієнтаційну роботу по залученню іноземних студентів на навчання в ЗІІ.`,
    science: ``,
  },
  {
    id: 'KI',
    name: 'Клопов Іван Олександрович',
    foto: 'img/teacher/klopov.jpg',
    phd: 'кандидат економічних наук, доцент',
    subject: [
      'Інформаційна безпека та захист інформації (ОПР «Бакалавр»)',
      'Інформаційний бізнес (ОПР «Бакалавр»)',
      'Методи та моделі штучного інтелекту (ОПР «Бакалавр»)',
      'Моделювання ризику в економіці (ОПР «Бакалавр»)',
      'Моделювання логістичних процесів (ОПР «Магістр»)',
    ],
    konsult: `Понеділок – 09.30 – 11.30, Середа – 09.30 – 11.30.`,
    biograf: `Народився 25 серпня 1984 року у м. Запоріжжя. У 1991 р. вступив до запорізької гімназії №31 з поглибленим вивченням англійської мови.

    У 2006 р. закінчив Запорізьку державну інженерну академію та здобув кваліфікацію магістр з економічної кібернетики. У 2007 р. закінчив Запорізький юридичних інститут здобувши кваліфікую юриста.
    
    2006-2009 рр. навчався в аспірантурі Запорізької державної інженерної академії за спеціальністю 08.00.11 – «Математичні методи, моделі та інформаційні технології в економіці». В 2012 р. захистив кандидатську дисертацію. В 2014 р. присвоєно вчене звання доцента кафедри економічної кібернетики.
    
    2014-2017 рр. навчався в докторантурі Донбаської державної інженерної академії.
    
    З 2007 працював в Запорізькій державній інженерній академії, обіймав посади асистента, старшого викладача та доцента кафедри економічної кібернетики.
    
    З 01.01.2019 р. і по теперішній час працює на посаді доцента кафедри економіки та інформаційних технологій Інженерного інституту Запорізького національного університету. Науково-педагогічний стаж - 11 років.`,
    science: `Сфери наукових інтересів: економіко-математичне моделювання економічної безпеки держави, регіону, підприємства; управління ризиками в процесі реалізації будівельних проектів; аналіз та обробка великих даних (BigData); моделі оцінювання економічної ефективності трансформації енергоспоживання на основі відновлюваних джерел енергії. 

    Тема дисертації на здобуття наукового ступеня кандидата економічних наук: «Моделювання економічної захищеності промислового підприємства» зі спеціальності 08.00.11 – математичні методи, моделі та інформаційні технології в економіці.
    
    Автор понад100 наукових праць (на початок 2019 р.), з них 5 колективних монографій, 33 наукові статті у фахових виданнях з економіки, більше 50 тез доповідей на конференціях, в т.ч. зі студентами.
    
    Проводить активну роботу з залучення студентів до наукової діяльності, є керівником кваліфікаційних робіт магістрів.
    
    Приймає активну учать у підготовці наукових проектів за Рамковою програмою Європейського Союзу з досліджень та інновацій «Горизонт 2020».`,
  },
  {
    id: 'KP',
    name: 'Комазов Павло Валерійович',
    foto: 'img/teacher/komazov.jpg',
    phd: 'кандидат економічних наук, доцент',
    subject: [
      'Інформаційні системи в економіці (ОПР «бакалавр»)',
      ' Інформаційний менеджмент (ОПР «магістр»)',
      'Прикладні задачі моделювання економічних процесів (ОПР «бакалавр»)',
      'Системи обробки економічної інформації (ОПР «бакалавр»)',
      'Технологія створення програмних та інтелектуальних систем (ОПР «бакалавр»)',
    ],
    konsult: 'Понеділок - 10.00 - 12.00 Середа - 09.00 - 11.00',
    biograf: `Народився 16 грудня 1969 р. У 1993 році закінчив математичний факультет ЗНУ за спеціальністю «Математика»; в 2000 році - Запорізьку державну інженерну академію, факультет післядипломної освіти за спеціальністю «Економіка підприємства»;  в 2009 році – Класичний приватний університет, за спеціальністю «Бізнес-адміністрування»; в 2014 році – Класичний приватний університет, факультет післядипломної освіти за спеціальністю «Фінанси і кредит».

    У 2008 року захистив кандидатську дисертацію за спеціальністю 08.00.11 – Математичні методи, моделі та інформаційні технології в економіці. Захист відбувся у Класичному приватному університеті (м. Запоріжжя). У 2012 році отримав вчене звання доцента кафедри менеджменту організацій Класичного приватного університету.
    
    З 1993 року працював у Запорізькій державній інженерній академії: 1993-1996 рр. – аспірант та асистент кафедри математичних методів економіки та інформаційних технологій.
    
    1996-1997 рр. – директор ліцею Запорізького інституту економіки та інформаційних технологій.
    
    З 1998 – асистент, та з 2008 р. – старший викладач кафедри економічної кібернетикиЗДІА.
    
    З 2008 по 2015 рр. працював у Класичному приватному університеті на посадах старшого викладача та доцента кафедри менеджменту організацій, а з 2012 – на посадах доцента  та заступника завідуючого кафедрою економічної кібернетики та статистики.
    
    2015-2018 рр. – доцент кафедри економіки та інформаційних технологій ЗДІА, з 01.01.2019 по теперішній час - доцент кафедри економіки та інформаційних технологій Інженерного інституту Запорізького національного університету.
    
    Науково-педагогічний стаж - 26 років.`,
    science: `Сфери наукових інтересів: управління ринковою вартістю підприємства; економіко-математичні методи та моделі прогнозування в системі управління економічним об'єктом; методи та моделі ідентифікації та управління фінансовим станом підприємства. Тема дисертації на здобуття наукового ступеня кандидата економічних наук: «Моделювання процесів управління вартістю підприємства в умовах ринку» зі спеціальності 08.00.11 – математичні методи, моделі та інформаційні технології в економіці. Неодноразово брав участь в атестації наукових працівників як офіційний опонент.

    Веде активну роботу по залученню студентів до наукової роботи. Здійснює керівництво кваліфікаційними роботами магістрів. Автор і співавтор понад 60 наукових праць (на початок 2019 р.), з них 4 колективних монографії, 20 наукових статей у фахових виданнях з економіки, більше 40 тез доповідей на конференціях, в т.ч. зі студентами. Проводить активну роботу з залучення студентів до наукової діяльності, є керівником кваліфікаційних робіт магістрів.
    
    Неодноразово отримував подяки: - за сумлінну працю та творчий підхід до управління закладом освіти нового покоління (від начальника управління  освіти Запорізької міської ради); - за організацію та підготовку студентів на Всеукраїнську олімпіаду (ректор ЗДІА); - за професіоналізм та бездоганне виконання службових обов’язків (ректор ЗДІА); - за проведення економіко-математичної олімпіади факультету економіки і менеджменту (ректор ЗДІА).`,
  },
  {
    id: 'MA',
    name: 'Макушинська Ганна Павлівна',
    foto: 'img/teacher/makushinska.jpg',
    phd: 'кандидат економічних наук, доцент',
    subject: [
      'Філософія (ОР "Бакалавр)',
      '  Політологія',
      'Етика',
      'Психологія',
      'Українська мова (за професійним спрямуванням)',
      'Польська мова',
    ],
    konsult: 'Середа 13:35 – 14:55',
    biograf: `У 1994 році закінчила Запорізький національний університет за спеціальністю "Філолог. Викладач української мови і літератури", у 2003 році захистила кандиатську дисертацію за спеціальністю 09.00.03 - соціальна філософія і філософія історії. Навчалась на дистанційній магістерській програмі екуменічних наук УКУ (м. Львів) за спеціальністю "Релігіна журналістика", проходила стажування в Університеті ім. Марії Склодовської-Кюрі (Люблін, Республіка Польща) 2016 р. в Інституті національної пам'яті (Варшава, Республіка Польща) 2017 р., у Вищій школі управління та охорони праці (Катовіце, Республіка Польща) 2018 р., в Літній академії польської мови і культури при університеті М.Коперніка (Торунь, Республіка Польща) 2018 р. З 2017 р. є керівником Центру польської мови і культури ім. Яна ІІІ Собеського.`,
    science: `Коло наукових інтересів: соціально-філософські та релігійні проблеми сучасного світу, тенденції та перспективи нової траекторії ваємодії України і Польщі. Автор близько 90 наукових публікацій, 2 монографій (у співавторстві з д.філос.н., проф. В.Жадьком та д.е.н., проф. Н.Метеленко). Була організатором численних наукових заходів: кількох міжнародних науково-практичних конференцій, круглих столів, виставок, фестивалів, більш, ніж 20 річної щомісячної роботи Філософського клубу. В цій роботі брали участь як громадські діячі та науковці зі світовим ім'ям, так і студенти.

    Нагороджена грамотами та подякою україно-польської парламентської групи Сейму РП.`,
  },

  {
    id: 'ME',
    name: 'Мержинський Євген Костянтинович',
    foto: 'img/teacher/merzhinskij.jpg',
    phd: 'кандидат економічних наук, доцент',
    subject: [
      'Електронна комерція (ОПР «бакалавр»)',
      'Моделювання в управлінні соціально-економічними системами (ОПР «магістр»)',
      'Управління проектами інформатизації(ОПР «магістр»)',
    ],
    konsult: 'Четвер - 10.00 - 12.00',
    biograf: `У 2005 р. закінчив факультет економіки підприємства Запорізької державної інженерної академії та одержав диплом магістра з відзнакою за спеціальністю «Економічна кібернетика». Протягом 2005-2009 рр. навчався в аспірантурі Запорізької державної інженерної академії на кафедрі економічної кібернетики. У 2014 р. захистив кандидатську дисертацію зі спеціальності 08.00.11 – математичні методи, моделі та інформаційні технології в економіці з присвоєнням вченого ступеня кандидата економічних наук. З 2005 р. працював в Запорізькій державній інженерній академії, обіймав посади асистента, старшого викладача та доцента кафедри економічної кібернетики. З 01.01.2019 р. і по теперішній час працює на посаді доцента кафедри економіки та інформаційних технологій Інженерного інституту Запорізького національного університету. Науково-педагогічний стаж - 14 років.`,
    science: `Сфери наукових інтересів: еколого-економічне моделювання соціально-економічних систем, моделювання інтелектуальних систем ухвалення рішень в економіці, сучасні технології big data та data mining, методи та моделі інвестиційної діяльності суб’єктів господарювання, агентне моделювання. Тема дисертації на здобуття наукового ступеня кандидата економічних наук: «Еколого-економічне моделювання процесів розподілу інвестиційних ресурсів в регіональному промисловому комплексі» зі спеціальності 08.00.11 – математичні методи, моделі та інформаційні технології в економіці. Автор понад60 наукових праць (на початок 2019 р.), з них 2 колективних монографій, 14 наукових статей у фахових виданнях з економіки, більше 40 тез доповідей на конференціях, в т.ч. зі студентами. Проводить активну роботу з залучення студентів до наукової діяльності, є керівником кваліфікаційних робіт магістрів. Брав участь у міжнародному науковому проекті Internalcontrol: COSO frame work applicability for universities, м. Київ за участі Норвезького університету NORD та закордонному науковому стажуванні в рамках науково-дидактичного співробітництва між Вищою школою управління охороною праці в Катовіцах (ВШУОП) і Запорізькою державною інженерною академією на тему «Забезпечення якості освіти у вищих навчальних закладах» реалізованому на базі ВШУОП м. Катовіце (Польща).`,
  },

  {
    id: 'PT',
    name: 'Пєтухова Ольга Василівна',
    foto: 'img/teacher/petukhova.jpg',
    phd: 'Старший лаборант',
    subject: ['Українська мова'],
    konsult: `Понеділок 12:00-13:00\n Середа 12:00-13:00\n П’ятниця 12:00-13:00`,
    biograf: `потребує уточнення`,
    science: 'потребує уточнення',
  },

  {
    id: 'SI',
    name: 'Сіліна Ірина Вадимівна',
    foto: 'img/teacher/silina.jpg',
    phd: 'кандидат економічних наук, доцент',
    subject: ['Податкова система', 'Податковий менеджмент', 'Місцеві фінанси', 'Страхування'],
    konsult: 'Понеділок 12:00-13:00 Середа 12:00-13:00 П’ятниця 12:00-13:00',
    biograf: `У 1994 році закінчила Запорізький індустріальний інститут і отримала другу вищу освіту за спеціальністю «Бухгалтерський облік, контроль та аналіз господарської діяльності» та здобула кваліфікацію економіст. Стаж практичної роботи на посаді головного бухгалтера 10 років.

    2000 - 2004 рр. викладач бухгалтерського обліку на факультеті післядипломної освіти Запорізької державної інженерної академії (ЗДІА).
    
    2004 – 2009 рр. старший викладач кафедри фінансів і бухгалтерського обліку в Запорізькому інституті економіки та інформаційних технологій (ЗІЕІТ).
    
    У 2009 році обрана на посаду доцента кафедри обліку і аудиту ЗІЕІТ. З 2010 по 2014 р. – заступник завідувача кафедри обліку і аудиту ЗІЕІТ.
    
    01.09.2014 – 31.12.2018 – доцент кафедри фінансів, банківської справи та страхування Запорізької державної інженерної академії, заступник завідувача кафедри з наукової роботи.`,
    science: `29.10.2012 р. – захист кандидатської дисертації на тему «Економічна ефективність інвестицій у природоохоронні заходи металургійних підприємств» на здобуття наукового ступеня кандидата економічних наук за спеціальністю 08.00.04 «Економіка та управління підприємствами (за видами економічної діяльності)». Кандидат економічних наук з квітня 2013 року.

    25.02.2016 р. – присвоєно вчене звання доцента кафедри фінансів, банківської справи та страхування.
    
    Сфера наукових інтересів:
    
    фінансове управління підприємницькими структурами; механізм управління фінансово-економічною безпекою суб’єктів господарювання.
    
    Автор(співавтор) понад 40 наукових та навчально-методичних праць.`,
  },
  {
    id: 'SV',
    name: 'Стоєв Володимир Леонідович',
    foto: 'img/teacher/stoev.jpg',
    phd: 'Кандидат економічних наук, доцент',
    subject: [
      'Аналіз стратегії виробничої діяльності',
      'Міжнародна економіка',
      'Інтелектуальний бізнес',
      'Основи управління персоналом у підприємницьких структурах',
      'Управління витратами',
    ],
    konsult: 'Вівторок 13:30-14:30, л416 Середа 18:00-19:00, л416',
    biograf: `працює на кафедрі економіки підприємства з 2014 р. на посадах старшого викладача (з 2014 року), доцента (з 2018 року).

    Стаж науково-педагогічної роботи 8 років, загальний стаж професійної діяльності в галузі економіки 27 років.
    
    Закінчив аспірантуру Полтавського національного технічного університету імені Юрія Кондратюка, в 2011 році захистив кандидатську дисертацію на тему «Основи фіскальної політики регіону».
    
    Сертифікований аудитор з 1997 року. З 2017 по 2019 рік очолює Запорізьке територіальне відділення Спілки аудиторів`,
    science: `Коло наукових інтересів: питання, пов’язані з організацією та веденням бізнесу в України та за кордоном, бізнес-плануванням, управлінським та бухгалтерським обліком, аудитом, оподаткуванням та забезпеченням регіонального і державного розвитку.

    Є автором монографій, наукових статей та практичних видань в сфері бізнесу.`,
  },

  {
    id: 'TE',
    name: 'Ткаченко Єлизавета Юріївна',
    foto: 'img/teacher/tkachenko.jpg',
    phd: 'кандидат економічних наук, доцент',
    subject: ['Логістика', 'Консалтинг', 'Фінансовий менеджмент', 'Логістика і консалтинг'],
    konsult: 'Середа, 11:35 – 13:05, Л-424',
    biograf: `Ткаченко Єлизавета Юріївна працює на посаді доцента кафедри фінансів, до цього працювала асистентом та старшим викладачем цієї ж кафедри. Працюючи доцентом кафедри фінансів, проявила себе як кваліфікований викладач, що постійно підвищує свій науково-педагогічний рівень.

    Педагогічна діяльність включає читання лекцій та проведення практичних занять з курсів "Фінансова діяльність суб’єктів господарювання", "Страхування", "Логістика", "Контролінг", "Економічний аналіз",  а також керівництво дипломним та курсовим проектуванням. Під час роботи у навчальному закладі нею підготовлені конспекти лекцій та методичні вказівки до виконання практичних робіт зі спецкурсів "Фінансова діяльність суб’єктів господарювання", "Страхування", "Логістика", "Контролінг". `,
    science: `Коло наукових інтересів Є.Ю. Ткаченко торкається дослідження питань, пов’язаних з аналізом інвестиційних проектів, встановлення їх прибутковості та ризику. Основні теоретичні і практичні результати досліджень доповідались на міжнародних та всеукраїнських наукових та науково-практичних конференціях.`,
  },
  {
    id: 'FV',
    name: 'Фатюха Вікторія Володимирівна',
    foto: 'img/teacher/fatyukha.jpg',
    phd: 'кандидат економічних наук, доцент',
    subject: [
      'Гроші та кредит',
      'Банківська система',
      'Банківські операції',
      'Аналіз банківської діяльності',
      'Бюджетування діяльності суб’єктів господарювання',
    ],
    konsult: 'Середа – з 13:05 до 14:30, ауд. Л-419',
    biograf: `Народилася у 1976 р. в м. Павлограді Дніпропетровської області. У 1994 р. закінчила із золотою медаллю СШ №6. У 1999 рр. закінчила вищий заклад освіти  «Українсько-фінський інститут менеджменту та бізнесу» за спеціальністю «Фінанси» та отримала диплом з відзнакою. Після закінчення вишу 5 років працювала у акціонерному банку «Металург».

    У 2002 р. вступила до денної аспірантури Запорізької державної інженерної академії за спеціальністю «Економіка та організація виробництва». З 2002 р. почала працювати асистентом кафедри фінансів ЗДІА.
    
    У 2007 р. захистила дисертацію на тему «Інформаційне забезпечення прийняття управлінських рішень на підприємствах машинобудування». У 2011 р. присвоєно вчене звання доцента кафедри фінансів.
    
    Наразі працюю доцентом кафедри фінансів, банківської справи та страхування в Інженерному інституті ЗНУ.`,
    science: `Коло наукових вподобань: державне регулювання грошової сфери; банківський менеджмент. Має понад 50 наукових публікацій, брала участь у складанні колективних монографій. Впродовж останніх років займається розподілом навчального навантаження кафедри, розробкою навчальних та робочих планів.`,
  },
  {
    id: 'XV',
    name: 'Хорошун Вікторія Василівна',
    foto: 'img/teacher/khoroshun.jpg',
    phd: 'Кандидат економічних наук, доцент',
    subject: [
      'Моделювання економічної динаміки (ОР «Магістр»)',
      'Системи підтримки прийняття рішень (ОР «Бакалавр»)',
      'Системи моніторингу в економіці (ОР «Бакалавр»)',
      'Прогнозування соціально-економічних процесів (ОР «Бакалавр»)',
    ],
    konsult: 'Понеділок – 9.00 – 11.00, Середа - 9.00 – 11.00.',
    biograf: `Народилася 25 травня 1982 р. у м. Запоріжжі, українка. У 1999 р. закінчила СШ № 30 з золотою медаллю. У 2004 р. закінчила факультет економіки підприємства Запорізької державної інженерної академії та одержала диплом магістра з відзнакою за спеціальністю «Економічна кібернетика». Протягом 2004-2007 рр. навчалася у аспірантурі Запорізької державної інженерної академії на кафедрі економічної кібернетики. У 2008 р. захистила кандидатську дисертацію зі спеціальності 08.00.11 – математичні методи, моделі та інформаційні технології в економіці з присвоєнням вченого ступеня кандидата економічних наук. В 2011 р. присвоєно вчене звання доцента кафедри економічної кібернетики. З 2004 р. працювала в Запорізької державної інженерної академії, обіймала посади асистента, старшого викладача та доцента кафедри економічної кібернетики. З 01.01.2019 р. і по теперішній час працює на посаді доцента кафедри економіки та інформаційних технологій Інженерного інституту Запорізького національного університету. Науково-педагогічний стаж - 15 років.`,
    science: `Сфери наукових інтересів:антикризове управління підприємствами; системи моніторингу розвитку економіки регіону; економіко-математичні моделі прогнозування розвитку суб‘єктів господарювання; методи та моделі прийняття управлінських рішень. Тема дисертації на здобуття наукового ступеня кандидата економічних наук: «Моделювання процесів бюджетного планування в управлінні регіональною економікою» зі спеціальності 08.00.11 – математичні методи, моделі та інформаційні технології в економіці. Автор понад 80 наукових праць (на початок 2019 р.), з них 7 колективних монографій, 24 наукові статті у фахових виданнях з економіки, більше 50 тез доповідей на конференціях, в т.ч. зі студентами. Проводить активну роботу з залучення студентів до наукової діяльності, є керівником кваліфікаційних робіт магістрів. На кафедрі економіки та інформаційних технологій відповідальна за наукову діяльність. При організації та проведенні кафедрою «Економіки та інформаційних технологій» Міжнародної науково-практичної інтернет-конференції «Інформація та бізнес: економічні аспекти моделювання» (16 листопада 2016 року) за участю колег з Литви та Всеукраїнської науково-практичної інтернет-конференції «Моделювання сталого розвитку в інформаційному суспільстві: цифрова економіка, управління, бізнес» (17 травня 2018 року) виконує функції відповідального секретаря конференцій. Нагороджена почесною грамотою облдержадміністрації у 2011 р. за високий особистий професіоналізм, значні досягнення у науковій діяльності, вагомий внесок у науково-технічний розвиток регіону та з нагоди Дня науки.`,
  },
  {
    id: 'SO',
    name: 'Шапуров Олександр Олександрович',
    foto: 'img/teacher/shapurov.jpg',
    phd: 'Кандидат економічних наук, доцент',
    subject: ['Інвестиційне кредитування', 'Інвестування', 'Інноваційний менеджмент'],
    konsult: 'Четвер – з 13:30 до 15:00, ауд. Л-419',
    biograf: `У 2001-2004 – навчання у Мелітопольському державному промислово-економічному технікумі. З 2004 р.  по 2007 р. – навчання у Таврійському державному агротехнологічному університеті, м. Мелітополь.

    03.09.2007- 01.04.2009 - асистент кафедри фінансового менеджменту та банківської справи Економіко-гуманітарного факультету Таврійського національного університету ім. В.І. Вернадського в м. Мелітополі. Потім працював асистентом кафедри фінансового менеджменту та банківської справи Економіко-гуманітарного факультету Запорізького національного університету. Далі – асистент кафедри менеджменту і туристичної індустрії Мелітопольського державного педагогічного університету ім. Б. Хмельницького.
    
    Після захисту 28.05.2010 р. кандидатської дисертації (Класичний приватний університет, м. Запоріжжя) працював старшим викладачем, доцентом кафедри фінансів, менеджменту та банківської справи Економіко-гуманітарного факультету ЗНУ.
    
    25.01.2013 р. – присвоєно вчене звання доцента кафедри фінансів, менеджменту та банківської справи(Запорізький національний університет, м. Запоріжжя)
    
    01.04.2013 – 30.06.2015 - в.о. завідувача кафедри фінансів, менеджменту та банківської справи Економіко-гуманітарного факультету ЗНУ.
    
    З 01.09.2015 по теперішній час – доцент кафедри фінансів, банківської справи та страхування Запорізької державної інженерної академії, зараз Інженерного інституту ЗНУ.`,
    science: `Сфера наукових інтересів: циклічність та економічне зростання в економіці, антикризове управління, діагностика банкрутства суб’єктів підприємницької діяльності, фінансова безпека, розвиток інвестиційної діяльності, стан інновацій в країні.

    Наукові публікації: 74 наукові роботи, з яких: 3 участі у колективних монографіях, 34 наукові статті у фахових виданнях, 3 видання внесені до наукометричних баз Web of Science та Scopus`,
  },

  {
    id: 'YO',
    name: 'Яришко Олена Володимирівна',
    foto: 'img/teacher/yarishko.jpg',
    phd: 'кандидат економічних наук, доцент',
    subject: ['Фінанси підприємств', 'Ринок фінансових послуг', 'Фінанси', 'Бюджетна система'],
    konsult: 'Cереда, 14:00-15:00',
    biograf: `Закінчила у 1999 р. Запорізьку державну інженерну академію і отримала повну вищу освіту. З січня 2000 р. працювала на посаді викладача економічних дисциплін Запорізького електротехнічного коледжу, виконувала обов’язки завідувача відділенням.

    Дата захисту 2006р.
    
    З 2003 року Яришко О.В. працює в Запорізькій державній інженерній академії спочатку на посаді асистента, потім старшого викладача, а з 2006 р. на посаді доцента.
    
    Педагогічна діяльність включає читання лекцій та проведення практичних занять з курсів «Фінанси, гроші та кредит», «Фінанси підприємств», «Фінанси», «Ринок фінансових послуг», а також керівництво дипломними та курсовими роботами.
    
    За час викладацької роботи є автором  та співавтором навчально-методичних посібників, має накові публікації.`,
    science: `Коло наукових інтересів Яришко О.В. досить широке, зокрема воно вміщує дослідження щодо підвищення ефективності фінансового управління бюджетними організаціями, дослідження щодо питань фінансового аналізу комерційних підприємств.`,
  },
];

module.exports = teachers;
